Repository: risuicpc/slatarahim
Catalog: lib/l10n/app_*.arb
Languages: am, sl

source: Slatarahim
am: ስላተራሂም
sl: ስላተራሂም

source: Home
am: መነሻ
sl: መንቄ

source: Family
am: ቤተሰብ
sl: አበሮስ

source: Add Family
am: ቤተሰብ አክሉ
sl: አበሮስ ድበሉ

# noGod
source: There is no god but allah, and
am: ከአላህ በስተቀር ሌላ አምላክ የለም
sl: ተአላህ ገነ ኢትገዙየን የሆነ ጎሽተ ኤለ

# messengerOfAllah
source: Muhammad is the messenger of Allah
am: ሙሐመድም የአላህ መልእክተኛ ናቸው
sl: ሙሐመድም የአላህ መልእክተኛኒሙ

source: ISLAM
am: እስልምና
sl: እስልምና

source: IMAN
am: ኢማን
sl: ኢማን

source: IHSAN
am: ኢህሳን
sl: ኢህሳን

source: Father
am: አባት
sl: አቦት

source: Mother
am: እናት
sl: እንደት

# son
source: {gender, select, male{He has 1 son} female{She has 1 son} males{He has {count} sons} females{She has {count} sons} other{}}
am: {gender, select, male{1 ወንድ ልጅ አለው} female{1 ወንድ ልጅ አላት} males{{count} ወንድ ልጆች አሉት} females{{count} ወንድ ልጆች አሏት} other{ }}
sl: {gender, select, male{1 ልጂ ወልድ አለይ} female{1 ልጂ ወልድ አሌት} males{{count} ልጂ ዌጃጆ አሉይ} females{{count} ልጂ ዌጃጆ አሎተ} other{}}

# daughter
source: {gender, select, male{He has 1 daughter} female{She has 1 daughter} males{He has {count} daughters} females{She has {count} daughters} other{}}
am: {gender, select, male{1 ሴት ልጅ አለው} female{1 ሴት ልጅ አላት} males{{count} ሴት ልጆች አሉት} females{{count} ሴት ልጆች አሏት} other{}}
sl: {gender, select, male{1 ገረድ ወልድ አለይ} female{1 ገረድ ወልድ አሌት} males{{count} ገረድ ዌጃጆ አሉይ} females{{count} ገረድ ዌጃጆ አሎተ} other{}}

# sonDaughter
source: {count, plural, =0{1 son and 1 daughter} =1{{sonCount} sons and 1 daughter} =2{1 son and {daughterCount} daughters} other{{sonCount} sons and {daughterCount} daughters}}
am: {count, plural, =0{1 ወንድና 1 ሴት} =1{{sonCount} ወንድና 1 ሴት} =2{1 ወንድና {daughterCount} ሴት} other{{sonCount} ወንድና {daughterCount} ሴት}}
sl: {count, plural, =0{1 ልጂ ዋ 1 ገረድ} =1{{sonCount} ልጂ ዋ 1 ገረድ} =2{1 ልጂ ዋ {daughterCount} ገረድ} other{{sonCount} ልጂ ዋ {daughterCount} ገረድ}}

# pronouns
source: {gender, select, male{He has} female{She has} other{}}
am: {gender, select, male{ልጆች አሉት} female{ልጆች አሏት} other{}}
sl: {gender, select, male{ዌጃጆ አሉይ} female{ዌጃጆ አሎተ} other{}}

# sonAndDaughter
source: {pronouns} {sonDaughter}
am: {sonDaughter} {pronouns}
sl: {sonDaughter} {pronouns}

# noChild
source: {gender, select, male{He has no child} female{She has no child} other{}}
am: {gender, select, male{ልጅ የለውም} female{ልጅ የላትም} other{}}
sl: {gender, select, male{ወልድ ኤለይ} female{ውልድ ኤሌተ} other{}}

# pronoun
source: {gender, select, male{His Child} female{Her Child} males{His Children} females{Her Children} other{}}
am: {gender, select, male{ልጁ} female{ልጇ} males{ልጆቹ} females{ልጆቿ} other{}}
sl: {gender, select, male{ወልድከ} female{ወልድሸ} males{ወልድቸከ} females{ውልድቸሽ} other{}}

# quraan
source: {"alHujuratVerses36": "O mankind! We created you from a single pair of a male and a female, and made you into nations and tribes that you might get to know one another. Surely the noblest of you in the sight of Allah is he who is the most righteous. Allah is All-Knowledgeable, All-Aware. Surah 49. Al-Hujurat, Ayah 13", "anNisaaVerses36": "Serve Allah and do not commit shirk (associate any partner) with Him, and be good to your parents, kinfolks, orphans, the helpless, near and far neighbors who keep company with you, the travellers in need, and the slaves you own. Allah does not love those who are arrogant and boastful. Surah 4. An-Nisaa, Ayah 36"}
am: {"alHujuratVerses36": "እናንተ ሰዎች ሆይ! እኛ ከወንድና ከሴት ፈጠርናችሁ፡፡ እንድትተዋወቁም ጎሳዎችና ነገዶች አደረግናችሁ፡፡ አላህ ዘንድ በላጫችሁ በጣም አላህን ፈሪያችሁ ነው፡፡ አላህ ግልጽን ዐዋቂ ውስጥንም ዐዋቂ ነው፡፡ ሱረቱ አል-ሁጁራት፣ አያህ 13", "anNisaaVerses36": "አላህንም ተገዙ፡፡ በእርሱም ምንንም አታጋሩ፡፡ በወላጆችና በቅርብ ዝምድና ባለቤትም፣ በየቲሞችም፣ በምስኪኖችም፣ በቅርብ ጎረቤትም፣ በሩቅ ጎረቤትም፣ በጎን ባልደረባም፣ በመንገደኛም፣ እጆቻችሁም ንብረት ባደረጓቸው (ባሮች)፣ መልካምን (ሥሩ)፤ አላህ ኩራተኛ ጉረኛ የኾነን ሰው አይወድም፡፡ ሱረቱ አን-ኒሳእ፣ አያህ 36"}
sl: {"alHujuratVerses36": "አቱም ሰብቻው! እኘ በልጅ ዋ በገረድ ከለቅነሙ፡፡ ልትቻቸሉም ጎሳ ዋ ጊቾ አሼነሙ፡፡ በአላህ ኤት ኢጠቅለማነይ ጥሽት አላህን ፈሪ የሆነን፡፡ አላህ ግልጠም ቻይ ውስጠም ቻይን፡፡ ሱረቱ አል-ሁጁራት፣ አያ 13", "anNisaaVerses36": "አላህነም ተገዙ፡፡ ቡሃም አደምግዝ አተሻርኩ፡፡ በአቦትም፣ ቢንደትም ዋ በቁርብ ኮባም፣ በቡጦም፣ በጩጥም፣ በቁርብ ኦላም፣ በሩቅ ኦላም፣ በደቦም፣ በጋዘኜም፣ ቢንጅመሙ ደር በሉይ ባርያዮ፣ ፈያ አሱ፤ አላህ ኩራተኛም ኪዝበኘም የሆነ ሰበ ኢሎድ፡፡ ሱረቱ አን-ኒሳእ፣ አያ 36"}

# dialog
source: {"islam": {"title": "The Five Pillars of Islam","text": "1. The profession of faith or shahada. 2. The duty to perform five daily prayers or salat. 3. The obligation to provide alms or zakat. 4. Fasting during the month of Ramadan. 5. Pilgrimage to Mecca (hajj)"},"iman": {"title": "The six pillars of Imaan","text": "1. Belief in Allah. 2. Belief in His Angels. 3. Belief in His books. 4. Belief in His messengers. 5. Belief in the final day (Hereafter). 6. Belief in the Qadar (Divine Decree)."},"ihsan": {"title": "Al-Ihsan means","text": "1. Perfection of what lies between the servant and his Lord. 2. Perfection of what is between the servant and the rest of the people. 3. Doing well and perfecting what you do."}}
am: {"islam": {"title": "አምስቱ የእስልምና መሰረቶች","text": "1. በአላህ አንድነት (ተውሂድ) ማመን እና መሐመድ የአላህ መልእክተኛ መሆነቸውን ማመን። 2. በቀን አምስት ጊዜ ሰላት መስገድ። 3. ምጽዋት ወይም ዘካ መስጠት። 4. የረመዷን ወር መጾም። 5. ወደ መካ (ሀጅ) ጉዞ መድረግ።"},"iman": {"title": "ስድስቱ የኢማን ምሰሶዎች","text": "1. በአላህ ማመን። 2. በመላእክቱ ማመን። 3. አላህ በወረዳው መጽሐፉ ማመን። 4. አላህ በለካቸው መልክተኞቹ ማመን። 5. በመጨረሻው ቀን ማመን. 6. በቀደር ማመን።"},"ihsan": {"title": "አል-ኢህሳን ማለት","text": "1. በባሪያውና በጌታው መካከል ያለው ፍፁምነት። 2. አላህን ልክ እንደምናየው እና እንደምየያን አድርገን መገዛት። 3. በአገልጋዩ እና በተቀረው ሰዎች መካከል ያለው ፍጹምነት።"}}
sl: {"islam": {"title": "አምስቲቸይ የእስልምና መከዛዞ","text": "1. በአላህ ሀድነት (በተውሂድ) ኢመኖት ዋ መሐመድ የአላህ ሉክተኛ ሁኖተኒም ኢመኖት። 2. በየም አምስተ ወክተ ሰላት ሲገዶት። 3. ዘካ ወቦት 4. የረመዳን ወር ሱሚኖት። 5. ቡምር ሀደግን ሀጅ አሶት።"},"iman": {"title": "ስድስትቻይ ኢማን","text": "1. በአላህ ኢመኖት 2. በመላይከ ኢመኖት 3. አላህ በወረዳይ ኪተብ ኢመኖት 4. አላህ በለከይሙይ ሉክተኛኞ ኢመኖት 5. በቂየማም አየም ኢመኖት. 6. በቀደር ኢመኖት"},"ihsan": {"title": "አል-ኢህሳን በሎት","text": "1. በባሪያይ ዋ በጎሽተከ ጉት የለይ ሸክ አልንበሮት። 2. አለሀን የንዥነያነኮ ዋ የንዥናነኮ አሶን ተገዞት። 3. በባሪያይ ዋ በገናይ ኡመት ጉት የለይ ሸክ አልንበሮት።"}}

# name
source: {"debalo": "Debalo","yesaliyaEndet": "","yemohammedEndet": "","yeredyEndet": "","yorkichoEndet": "","medinaMshira": "Medina Mshira","shewbo": "Shewbo","yeabdiEndet": "","ayriyaSiraj": "Ayriya Siraj","jemilaRedi": "Jemila Redi","awelShukur": "Awel Shukur","mehbuba": "Mehbuba","nefisaSheman": "Nefisa S/Aman","alewiya": "Ekram","yesin": "Yesin","zeyneba": "Zeyneba","nudo": "Nudo","behreSurur": "Behre Surur","zulfaNuri": "Zulfa Nuri","shemsiyaTemam": "Shemsiya Temam","megfiraNesir": "Megfira Nesir","ziyeda": "Ziyeda","jemilaAbdela": "Jemila Abdela","abrarSheali": "Abrar S/Ali","shemsiyaLalo": "Shemsiya Lalo","mohammed": "Mohammed","kiyarSiraj": "Kiyar Siraj","shewmolo": "Shewmolo","ademAwol": "Adem Awol","abduremanAsrar": "Abdureman Asrar","behreRedi": "Behre Redi","seid": "Seid","saliya": "Saliya","abdo": "Abdo","sheHessan": "S/Hessan","redi": "Redi","sheKedir": "S/Kedir","usman": "Usman","werqicho": "Werqicho","kamil": "Kamil","zeyne": "Zeyne","zehra": "Zehra","shifo": "Shifo","zeyda": "Zeyda","shukra": "Shukra","kedija": "Kedija","nuriya": "Nuriya","keyria": "Keyria","denur": "Denur","sheSirej": "S/Sirej","jemal": "Jemal","abdulkerim": "Abdulkerim","ali": "Ali","fetiya": "Fetiya","ruqiya": "Ruqiya","zemzo": "Zemzo","merdiya": "Merdiya","abdulhafiz": "Abdulhafiz","abdulnesir": "Abdulnesir","merema": "Merema","neja": "Neja","sefiya": "Sefiya","seifu": "Seifu","jelaludin": "Jelaludin","ashreqa": "Ashreqa","kedir": "Kedir","ayshe": "Ayshe","muaz": "Muaz","asiya": "Asiya","fakiya": "Fakiya","kesim": "Kesim","mekiya": "Mekiya","ishaq": "Ishaq","shekir": "Shekir","abubeker": "Abubeker","hesinat": "Hesinat","selehadin": "Selehadin","feyza": "Feyza","ezedin": "Ezedin","nesre": "Nesre","fejru": "Fejru","sejida": "Sejida","temima": "Temima","rebiya": "Rebiya","sheyte": "Sheyte","siham": "Siham","ajiba": "Ajiba","shemse": "Shemse","alima": "Alima","mustefa": "Mustefa","selman": "Selman","sebehadin": "Sebehadin","semira": "Semira","fedil": "Fedil","hikma": "Hikma","sewda": "Sewda","khelid": "Khelid","usen": "Usen","sheMohammedNur": "S/Mohammednur","fadila": "Fadila","behriya": "Behriya","shemima": "Shemima","ridwen": "Ridwen","kezina": "Kezina","zebiba": "Zebiba","nesriya": "Nesriya","sebla": "Sebla","semiya": "Semiya","seyfu": "Seyfu","sufiya": "Sufiya","shemsiya": "Shemsiya","abdilsemed": "Abdilsemed","wesila": "Wesila","fuad": "Fuad","reyan": "Reyan","meymuna": "Meymuna","keshfu": "Keshfu","jezira": "Jezira","imran": "Imran","heyatuDeri": "Heyatu Deri","tesnim": "Tesnim","yesulalaEndet":"","sulela":"Sulela"}
am: {"debalo": "ደበሎ","yesaliyaEndet": "የሰልያ እነት","yemohammedEndet": "የመሀመድ እነት","yeredyEndet": "የረዲ እነት","yorkichoEndet": "የወርቅቾ እነት","medinaShurala": "መዲና ሹረላ","shewbo": "ሸውቦ","yeabdiEndet": "የአብዲ እነት","ayriyaSiraj": "አይሪያ ሲራጅ","jemilaRedi": "ጀማል ረዲ","awelShukur": "አወል ሹኩር","mehbuba": "መህቡባ","nefisaSheman": "ነፊሳ ሸህአማን","alewiya": "ኢክራም","yenejaAbet": "የነጃ አባት","zeyneba": "ዘይነባ","nudo": "ኑዶ","behreSurur": "በህሬ ሱሩር","zulfaNuri": "ዙልፋ ኑሪ","shemsiyaTemam": "ሸምሲያ ተማም","megfiraNesir": "መግፊራ ነሲር","ziyeda": "ዚየዳ","jemilaAbdela": "ጀሚላ አብደላ","abrarSheali": "አብራር ሸህአሊ","shemsiyaLalo": "ሸምሲያ ላሎ","mohammed": "መሀመድ","kiyarSiraj": "ኪያር ሲራጅ","shewmolo": "ሸውሞሎ","ademAwol": "አደም አወል","abduremanAsrar": "አብዱረህማን አስራር","behreRedi": "በህሬ ረዲ","siyd": "ሰይድ","saliya": "ሰሊያ","abdo": "አብዶ","sheHessan": "ሸህሃሳን","redi": "ረዲ","sheKedir": "ሸህከዲር","usman": "ኡስማን","werqicho": "ወርቂቾ","kamil": "ከሚል","zeyne": "ዘይኔ","zehra": "ዘህራ","shifo": "ሺፎ","zeyda": "ዘይዳ","shukra": "ሹክራ","kedija": "ከዲጃ","nuriya": "ኑሪያ","keyria": "ከይሪያ","denur": "ደኑር","sheSirej": "ሸህስራጅ","jemal": "ጀማል","abdulkerim": "አብዱልከሪም","ali": "አሊ","fetiya": "ፈቲያ","ruqiya": "ሩቂያ","zemzo": "ዘምዞ","merdiya": "መርዲያ","abdulhafiz": "አብዱልሃፊዝ","abdulnesir": "አብዱልነሲር","merema": "መሬማ","neja": "ነጃ","sefiya": "ሰፍያ","seifu": "ሰይፉ","jelaludin": "ጀላሉዲን","ashreqa": "አሽረቃ","kedir": "ከዲር","ayshe": "አይሸ","muaz": "ሙአዝ","asiya": "አስያ","fakiya": "ፈኪያ","kesim": "ቀሲም","mekiya": "መኪያ","isaq": "ኢሳቅ","shekir": "ሸኪር","abubeker": "አቡበከር","hesinat": "ሀሲናት","selehadin": "ሰለሃዲን","feyza": "ፈይዛ","ezedin": "ኢዘዲን","nesre": "ነስሬ","fejru": "ፈጅሩ","sejida": "ሰጂዳ","temima": "ተሚማ","rebiya": "ረቢያ","sheyte": "ሸይቴ","siham": "ሲሃም","ajiba": "አጂባ","shemse": "ሸምሴ","alima": "አሊማ","mustefa": "ሙስጠፋ","selman": "ሰልማን","sebehadin": "ሰበሃዲን","semira": "ሰሚራ","fedil": "ፋዲል","hikma": "ሂክማ","sewda": "ሰውዳ","khelid": "ኸሊድ","usen": "ኡሰን","sheMohammedNur": "ሸህመሀመድኑር","fadila": "ፈዲላ","behriya": "በህሪያ","shemima": "ሸሚማ","ridwen": "ሪድወን","kezina": "ከዚና","zebiba": "ዘቢባ","nesriya": "ነስሪያ","sebla": "ሰብላ","semiya": "ሰሚያ","seyfu": "ሰይፉ","sufiya": "ሱፊያ","shemsiya": "ሸምሲያ","abdilsemed": "አብዱሰመድ","wesila": "ወሲላ","fuad": "ፉወድ","reyan": "ረያን","meymuna": "መይሙና","keshfu": "ከሽፉ","jezira": "ጀዚራ"}
sl: {"debalo": "ደበሎ","yesaliyaEndet": "","yemohammedEndet": "","yeredyEndet": "","yorkichoEndet": "","medinaMshira": "መዲና ምሺራ","shewbo": "ሸውቦ","yeabdiEndet": "","ayriyaSiraj": "አይሪያ ሲራጅ","jemilaRedi": "ጀማል ረዲ","awelShukur": "አወል ሹኩር","mehbuba": "መህቡባ","nefisaSheman": "ነፊሳ ሸህአማን","alewiya": "ኢክራም","yesin": "የሲን","zeyneba": "ዘይነባ","nudo": "ኑዶ","behreSurur": "በህሬ ሱሩር","zulfaNuri": "ዙልፋ ኑሪ","shemsiyaTemam": "ሸምሲያ ተማም","megfiraNesir": "መግፊራ ነሲር","ziyeda": "ዚየዳ","jemilaAbdela": "ጀሚላ አብደላ","abrarSheali": "አብራር ሸህአሊ","shemsiyaLalo": "ሸምሲያ ላሎ","mohammed": "መሀመድ","kiyarSiraj": "ኪያር ሲራጅ","shewmolo": "ሸውሞሎ","ademAwol": "አደም አወል","abduremanAsrar": "አብዱረህማን አስራር","behreRedi": "በህሬ ረዲ","siyd": "ሰይድ","saliya": "ሰሊያ","abdo": "አብዶ","sheHessan": "ሸህሃሳን","redi": "ረዲ","sheKedir": "ሸህከዲር","usman": "ኡስማን","werqicho": "ወርቂቾ","kamil": "ከሚል","zeyne": "ዘይኔ","zehra": "ዘህራ","shifo": "ሺፎ","zeyda": "ዘይዳ","shukra": "ሹክራ","kedija": "ከዲጃ","nuriya": "ኑሪያ","keyria": "ከይሪያ","denur": "ደኑር","sheSirej": "ሸህስራጅ","jemal": "ጀማል","abdulkerim": "አብዱልከሪም","ali": "አሊ","fetiya": "ፈቲያ","ruqiya": "ሩቂያ","zemzo": "ዘምዞ","merdiya": "መርዲያ","abdulhafiz": "አብዱልሃፊዝ","abdulnesir": "አብዱልነሲር","merema": "መሬማ","neja": "ነጃ","sefiya": "ሰፍያ","seifu": "ሰይፉ","jelaludin": "ጀላሉዲን","ashreqa": "አሽረቃ","kedir": "ከዲር","ayshe": "አይሸ","muaz": "ሙአዝ","asiya": "አስያ","fakiya": "ፈኪያ","kesim": "ቀሲም","mekiya": "መኪያ","ishaq": "ኢስሃቅ","shekir": "ሸኪር","abubeker": "አቡበከር","hesinat": "ሀሲናት","selehadin": "ሰለሃዲን","feyza": "ፈይዛ","ezedin": "ኢዘዲን","nesre": "ነስሬ","fejru": "ፈጅሩ","sejida": "ሰጂዳ","temima": "ተሚማ","rebiya": "ረቢያ","sheyte": "ሸይቴ","siham": "ሲሃም","ajiba": "አጂባ","shemse": "ሸምሴ","alima": "አሊማ","mustefa": "ሙስጠፋ","selman": "ሰልማን","sebehadin": "ሰበሃዲን","semira": "ሰሚራ","fedil": "ፋዲል","hikma": "ሂክማ","sewda": "ሰውዳ","khelid": "ከሊድ","usen": "ኡሰን","sheMohammedNur": "ሸህመሀመድኑር","fadila": "ፈዲላ","behriya": "በህሪያ","shemima": "ሸሚማ","ridwen": "ሪድወን","kezina": "ከዚና","zebiba": "ዘቢባ","nesriya": "ነስሪያ","sebla": "ሰብላ","semiya": "ሰሚያ","seyfu": "ሰይፉ","sufiya": "ሱፊያ","shemsiya": "ሸምሲያ","abdilsemed": "አብዱሰመድ","wesila": "ወሲላ","fuad": "ፉወድ","reyan": "ረያን","meymuna": "መይሙና","keshfu": "ከሽፉ","jezira": "ጀዚራ","imran": "ኢምራን","heyatuDeri": "ሀያቱ ደሪ","tesnim": "ተስኒም","yesulalaEndet":"","sulela":"ሱለላ"}

# address
source: {"aretbar": "Aretbar","sirt": "Sirt","ansewa": "Ansewa","alsis": "Alsis","senkura": "Senkura","danecho": "Danecho","wenji": "Wenji","adama": "Adama","alicho": "Alicho","yebu": "Yebu","metahara": "Metahara","worabe": "Worabe","alsisNigdibr": "Alsis Nigdibr","addisAbaba": "Addis Ababa","alkeso": "Alkeso","kala": "Kala","nigdibr": "Nigdibr","aybat": "Aybat","anshebeso": "Anshebeso","mito": "Mito","ashkokele": "Ashkokele"}
am: {"aretbar": "አረትባር","sirt": "ሲርጥ","ansewa": "አንሰዋ","alsis": "አልሲስ","senkura": "ሰንኩራ","danecho": "ደኔቾ","wenji": "ወንጂ","adama": "አደማ","alicho": "አሊቾ","yebu": "የቡ","metahara": "መተሃራ","worabe": "ወራቤ","alsisNigdibr": "አልሲስኒግድብር","addisAbaba": "አዲስ አባባ","alkeso": "አልከሶ","kala": "ቀላ","nigdibr": "ኒግዲብር","aybat": "አይባት","anshebeso": "አንሸቤሶ","mito": "ሚቶ"}
sl: {"aretbar": "አረትባር","sirt": "ሲርጥ","ansewa": "አንሰዋ","alsis": "አልሲስ","senkura": "ሰንኩራ","danecho": "ደኔቾ","wenji": "ወንጂ","adama": "አደማ","alicho": "አሊቾ","yebu": "የቡ","metahara": "መተሃራ","worabe": "ወራቤ","alsisNigdibr": "አልሲስኒግድብር","addisAbaba": "አዲስ አባባ","alkeso": "አልከሶ","kala": "ቀላ","nigdibr": "ኒግዲብር","aybat": "አይባት","anshebeso": "አንሸቤሶ","mito": "ሚቶ","ashkokele": "አሽኮከለ"}

# comingSoon
source: Coming soon inshaAllah
am: በቅርቡ ኢንሻአላህ
sl: በቁርብ ኢንሻአላህ
